

https://kusto.azure.com/clusters/help/databases/Samples



=========================
Advanced Hunting with KQL 
=========================

//Get the list of non-internal email addresses where <insert CEO name here> is the "SenderDisplayName"
//To find just gmail addresses - you can also add | where SenderFromAddress endswith "@gmail.com"
//Note that using the "!" in front of the "!contains" means it does not contain that value. 


EmailEvents
| where Timestamp > ago(90d)
| where SenderDisplayName has "John Smith"
| where SenderMailFromDomain !contains "smithtech.com"
| where SenderMailFromDomain !contains "smithtechsisterco.com"



==============
https://medium.com/mii-cybersec/advanced-threat-hunting-queries-using-kql-kusto-query-language-77a507f067bf
//Registry Persistence commonly used to find Registry Persistance

DeviceRegistryEvents
| where ActionType == "RegistryValueSet"
| where RegistryKey endswith @"\Software\Microsoft\Windows\CurrentVersion\RunServiceOnce"
    or RegistryKey endswith @"Software\Microsoft\Windows\CurrentVersion\RunServices"
    
=========================
    
    
